## Main steps to prepare data for machine learning algorithms
**Note: data must be in 2-D matrix shape (alrady is, while its loaded as table)**

* 1- <a href='#nullvalues'>Dealing with null Values</a>: The data must be clear from any null values.
* 2- <a href='#nullvalues'>Numerical Values</a>: The data type must be/convert in/to numerical which uses in arithmatic operations.
* 3- <a href='#scaling'> Data Scaling</a>: The data columns must be/convert in/to a simmilar range.

In [1]:
import numpy as np
import pandas as pd
import os

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
data_file = data_file = os.path.join('D:', os.path.sep, 'Datasets', 'general', 'Sample_Preprocessing.csv')
data_file

'D:\\Datasets\\general\\Sample_Preprocessing.csv'

In [3]:
df = pd.read_csv(data_file)
df.head()

     Country   Age   Salary Purchased
0      India  34.0  92000.0       Yes
1  Sri lanka  22.0  25000.0       Yes
2      China  31.0  74000.0       Yes
3  Sri lanka  29.0      NaN        No
4      China  55.0  98000.0       Yes

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    15 non-null     object
 1   Age        15 non-null     float64
 2   Salary     15 non-null     float64
 3   Purchased  16 non-null     object
dtypes: float64(2), object(2)
memory usage: 640.0+ bytes

<a id='nullvalues'></a>
## Dealing with null Values
<ol>
<li>Delete rows with null values.</li> 
<li>Fill null values of data column based on statistical momentums (Mean/Median/Mode/Trimmed Mean).</li>
     <ul><li>(May affect or corrupt data distribution, especially if null values have enoumous count)</li>
         <li>e.g: Kurtosis may increse.</li></ul>
<li>Fill null values of data column with RANDOM values in data range.</li>
<li>Fill null values of data column with fixed value (like 0).</li>
<li>KNN Imputer</li>
    
</ol>

In [10]:
df.isnull().any()

Country       True
Age           True
Salary        True
Purchased    False
dtype: bool

In [11]:
# Total null values
df.isnull().any().sum()

3

In [12]:
# Show rows which contains null values
df[df.isna().any(axis=1)]

     Country   Age   Salary Purchased
3  Sri lanka  29.0      NaN        No
6        NaN  43.0  70000.0       Yes
8      India   NaN  60000.0        No

In [13]:
# Show NOT NULL rows
df[df.notna().all(axis=1)]

      Country   Age   Salary Purchased
0       India  34.0  92000.0       Yes
1   Sri lanka  22.0  25000.0       Yes
2       China  31.0  74000.0       Yes
4       China  55.0  98000.0       Yes
5       India  24.0  30000.0        No
7   Sri lanka  28.0  40000.0        No
9       China  51.0  89000.0       Yes
10      India  44.0  78000.0       Yes
11  Sri lanka  21.0  20000.0        No
12      China  25.0  30000.0       Yes
13      India  33.0  45000.0       Yes
14      India  42.0  65000.0       Yes
15  Sri lanka  33.0  22000.0        No

### 1- Delete rows with null values: